lxyppc/lxyppc-oled/ lxyppc-oled/STM32/oleddrv/src/main.c
/*******************************************************************************
* File Name          : main.c
* Author             : lxyppc
* Version            : V1.0
* Date               : 10-01-21
* Description        : Main program body
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_lib.h"
#include "bsp.h"
#include "SSD1303.h"
#include "Graphics\Graphics.h"  // Graphic primitives layer
#include "ClockUI.h"
#include "ClockSet.h"
#include "Encoder.h"
#include "..\..\oledLoader\Inc\Export.h"
#include "time.h"
#include "icon.h"
#include "menu.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
//#define   RTCClockSource_LSI
#define   RTCClockSource_LSE

/* Private macro -------------------------------------------------------------*/
#define WAIT_UNTIL_FINISH(x) (x)

/* Private variables ---------------------------------------------------------*/
static  u32  minute = 0;
static  s16 encCount = 0;
static vu32 TimeDisplay = 0;
static  const char HexTable[] = "0123456789ABCDEF";
ADResult_t    ADCResult;

/* Private function prototypes -----------------------------------------------*/
void RCC_Configuration(void);
void NVIC_Configuration(void);
void SSD1303_IO_Configuration(void);
void SSD1303_Controller_Init(void);
void CCW_Rotate(unsigned char *des, const unsigned char *src);
void RTC_Configuration(void);
void Initial_Tim2(void);
void InitialIO(void);
void InitialADC(void);
void InitialSystem();
#ifdef    DEBUG_UI
u32  InitialUIDebugger(u16 width, u16 height, u16 depth, u8* buffer);
#endif
/* Private functions ---------------------------------------------------------*/
void  GraphTest(void)
{
  SHORT counter;
  Device dev;
  InitialDevice(&dev,&SSD1303_Prop,SongSmall5_DrawChar);
  
  while(1){
    SetColor(WHITE);
    for(counter=0; counter<GetMaxX(); counter+=20){
      DelayMs(500);
      WAIT_UNTIL_FINISH(Line(counter,0,GetMaxX()-1-counter,GetMaxY()-1));
    }
    
    DelayMs(2000);
    
    for(counter=10; counter<GetMaxY()>>1; counter+=10){
      DelayMs(500);
      WAIT_UNTIL_FINISH(Circle(GetMaxX()>>1,GetMaxY()>>1,counter));
    }
    
    DelayMs(2000);
    WAIT_UNTIL_FINISH(FillCircle(GetMaxX()>>1,GetMaxY()>>1,10));
    
    DelayMs(2000);
    WAIT_UNTIL_FINISH(FillCircle(GetMaxX()>>1,GetMaxY()>>1,20));
    
    DelayMs(2000);
    WAIT_UNTIL_FINISH(FillCircle(GetMaxX()>>1,GetMaxY()>>1,30));
    
    DelayMs(2000);
    SetColor(BLACK);
    ClearDevice();

    SetColor(WHITE);
    WAIT_UNTIL_FINISH(Bevel((GetMaxX()>>1)-30,(GetMaxY()>>1)-30,(GetMaxX()>>1)+30,(GetMaxY()>>1)+30,15));
    
    WAIT_UNTIL_FINISH(Bevel((GetMaxX()>>1)-20,(GetMaxY()>>1)-20,(GetMaxX()>>1)+20,(GetMaxY()>>1)+20,15));
    
    WAIT_UNTIL_FINISH(Bevel((GetMaxX()>>1)-10,(GetMaxY()>>1)-10,(GetMaxX()>>1)+10,(GetMaxY()>>1)+10,15));
    
    DelayMs(2000);
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);
    WAIT_UNTIL_FINISH(Arc((GetMaxX()>>1)-30,(GetMaxY()>>1)-30,(GetMaxX()>>1)+30,(GetMaxY()>>1)+30,10,15,0xFF));
    
    WAIT_UNTIL_FINISH(Arc((GetMaxX()>>1)-20,(GetMaxY()>>1)-20,(GetMaxX()>>1)+20,(GetMaxY()>>1)+20,10,15,0xFF));
    
    WAIT_UNTIL_FINISH(Arc((GetMaxX()>>1)-10,(GetMaxY()>>1)-10,(GetMaxX()>>1)+10,(GetMaxY()>>1)+10,10,15,0xFF));
    
    DelayMs(2000);
    SetColor(BLACK);
    ClearDevice();
    
    SetColor(WHITE);
    
    for(counter=0; counter<GetMaxY()>>1; counter+=4){
      DelayMs(500);
      WAIT_UNTIL_FINISH(Rectangle(GetMaxX()/2-counter,
                                  GetMaxY()/2-counter,
                                  GetMaxX()/2+counter,
                                  GetMaxY()/2+counter));
    }
    
    DelayMs(2000);
    SetColor(BLACK);
    ClearDevice();
    
      /* Draw a box */
    for(u32 x=0;x<128;x++){
      SetPoint(&dev,x,0);
      SetPoint(&dev,x,63);
    }
    for(u32 y=0;y<63;y++){
      SetPoint(&dev,0,y);
      SetPoint(&dev,127,y);
    }
    static u32 yPos = 1;
    yPos = 0;
    while(1){
      unsigned long xPos = 10;
      yPos++;
      if(yPos == 47){
        break;
      }
      /* Cleare previous display data */
      TextOut(&dev,xPos,yPos>1?yPos-1:46,"              ",0xff);
      /* Output the English characters "Hello" */
      xPos = TextOut(&dev,xPos,yPos,"Hello ",0xFF);
      /* Output the Chinese characters "ÊÀ½ç" */
      xPos = TextOut(&dev,xPos,yPos,"World",2);
      /* Output the '!' sign */
      //xPos = TextOut(&dev,xPos,yPos,"!",0xFF);
      
      TextOut(&dev,xPos + 8,8, (yPos & 2) ? (yPos&1 ? "\\" : "-" ) : (yPos&1 ? "/" : "|" ),0xFF);
      
      for(u32 i=2000000;--i;);
    }
    SetColor(BLACK);
    ClearDevice();
    break;
  }
}

/*******************************************************************************
* Function Name  : main
* Description    : Main program
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
int main(void)
{
#ifdef DEBUG
  debug();
#endif
  {
    /*
      Todo: the app will crash if remove the follow codes
    */
    time_t now = 0;
    struct tm* curTm = localtime(&now);
  }
  
  InitialSystem();
  //GraphTest();
  Device dev;
  InitialDevice(&dev,&SSD1303_Prop,SongSmall5_DrawChar);
  
  //SpecTextOut(&dev,1,10,song_6_fontBuffer,7);
  //while(1);
  InitialMenu();
  while(1){
    static  Msg msg;
    if(GetMessage(&msg)){
      MenuProcess(&msg);
    }
  }
  
  Clock_DrawFace(GetMaxY()>>1,GetMaxY()>>1,GetMaxY()>>1);
  //Line(counter,0,GetMaxX()-1-counter,GetMaxY()-1);
  while(1){
    static  Msg msg;
    if(!GetMessage(&msg))continue;
//    if(minute != lastM){
//      lastM = minute;
//      char buf[] = {minute/10+'0',minute%10+'0',0};
//      TextOut(&dev,80,20,buf,0xff);
//      if(encCount<0){
//        encCount = -encCount;
//        char buf[] = {'-',encCount/10+'0',encCount%10+'0',0};
//        TextOut(&dev,100,20,buf,0xff);
//      }else{
//        char buf[] = {'+',encCount/10+'0',encCount%10+'0',0};
//        TextOut(&dev,100,20,buf,0xff);
//      }
//    }
    if(msg.message == MSG_KEY_UP){
      if(SSD1303_IsOn()){
        SSD1303_TurnOff();
      }else{
        SSD1303_TurnOn();
      }
      char buf[] = {minute/10+'0',minute%10+'0',0};
      TextOut(&dev,80,40,buf,0xff);
    }
    char buf[64];
    if(ReadUsbData(buf,64) == LDR_SUCCESS){
      if(buf[1] == 0xAA){
        RTC_SetCounter(*(u32*)(buf+4));
        RTC_WaitForLastTask();
      }
    }
    if(msg.message == MSG_SECOND){
    //if(TimeDisplay){
      CheckConnection();
      vu16 ccr1 = TIM3->CCR1;
      Pos_t x = 64;
      Pos_t y = 16;
      TimeDisplay = 0;
      u32 TimeVar = RTC_GetCounter();
      u32 THH = 0, TMM = 0, TSS = 0;
      /* Compute  hours */
      THH = TimeVar / 3600;
      /* Compute minutes */
      TMM = (TimeVar % 3600) / 60;
      /* Compute seconds */
      TSS = (TimeVar % 3600) % 60;
      char tBuf[64] = {1};
      //x = TextOut(&dev,x,y,tBuf+1,0xff);
      Clock_UpdateTime(THH,TMM,TSS);
      time_t now = (time_t)TimeVar;
      char* p = ctime(&now);
      for(u32 i=0;i<26;){
        i++;
        tBuf[i] = *p++;
      }
      TextOut_HighLight(&dev,x,y,tBuf+12,8);
      TextOut(&dev,x,y+16,tBuf+5,6);
      TextOut(&dev,x,y+32,tBuf+21,4);
      TextOut(&dev,x+32,y+32,tBuf+20,1);
      TextOut_HighLight(&dev,x+40,y+32,tBuf+1,3);
      if(0){
        u32 res = ADCResult.ADBat;
        res = res * 328 * 136 / (4096*100);
//        char ADBuf[] = {'0', 'x', HexTable[(res>>12)&0xF],
//        HexTable[(res>>8)&0xF],HexTable[(res>>4)&0xF],HexTable[res&0xF],0};
        
        char ADBuf[] = {'B', 'a', 't', HexTable[(res/100)%10], '.', 
        HexTable[(res/10)%10], HexTable[res%10],'V', 0};
        y+=16;
        TextOut(&dev,x,y,ADBuf,8);
      }
      if(0){
        u16 res = ADCResult.ADX;
        char ADBuf[] = {'0', 'x', HexTable[(res>>12)&0xF],
        HexTable[(res>>8)&0xF],HexTable[(res>>4)&0xF],HexTable[res&0xF],
        ' ', IsPGOOD() ? 'P' : 'X', 0};
        y+=16;
        TextOut(&dev,x,y,ADBuf,8);
      }
      if(0){
        u16 res = ADCResult.ADY;
        char ADBuf[] = {'0', 'x', HexTable[(res>>12)&0xF],
        HexTable[(res>>8)&0xF],HexTable[(res>>4)&0xF],HexTable[res&0xF],
        ' ', IsCHG() ? 'C' : 'X', 0};
        y+=16;
        TextOut(&dev,x,y,ADBuf,8);
      }
      
