lxyppc/lxyppc-oled/ lxyppc-oled/STM32/oleddrv/src/main.c
      static unsigned char icoY = 0;
      //icoY++;
      //if(icoY==64)icoY=0;
      if(IsCHG()){
        DrawIcon(104,icoY,ICON_ID_CHARGE);
      }else if(IsPGOOD()){
        DrawIcon(104,icoY,ICON_ID_POWER);
      }else{
        DrawIcon(104,0,ICON_ID_BATTARY);
        // Battary check
        // Full charge is 4.2V, lower power is 3.3V
        // Vref = 3.28V
        // 10K/13.6K
        // 4.2*10/13.6/3.28*4096 = 3875
        // 3.3*10/13.6/3.28*4096 = 3030
        u32 res = ADCResult.ADBat;
        if(res > 3835){
          res = 800;
        }else if(res < 3030){
          res = 0;
        }else{
          res -= 3030;
        }
        res = 16*res/800;
        res += 106;
        SetColor(BLACK);
        SetLineThickness(NORMAL_LINE);
        Bar(res,2,121,7);
      }
      
      WaitAndSendUsbData(tBuf,64,1);
      //ToggleLED();
    }
  }
}

/*******************************************************************************
* Function Name  : InitialSystem
* Description    : Initialize the system
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void InitialSystem()
{
  GPIO_AFIODeInit();
  GPIO_DeInit(GPIOB);
  /* The bootloader has already initialize the GPIOA*/
  //GPIO_DeInit(GPIOA);
  GPIO_DeInit(GPIOD);
  
  /* NVIC configuration */
  NVIC_Configuration();
  
  /* Initialize GPIO */
  InitialIO();
  
  /* Initialize ADC */
  InitialADC();
  
  /* Initializer system colck */
#ifdef  DEBUG_UI
  InitialUIDebugger(128, 64, 1, SSD1303_GetBuffer());
#else
  RCC_DeInit();
  CheckConnection();
  
  /* Initialize the SSD1303 related IO */
  SSD1303_IO_Configuration();
  
  /* Initialize the SSD1303 */
  SSD1303_Init();
#endif
  
  /* Initialize the SSD1303 controller,
  which is simulated by STM32 DMA and systick*/
  SSD1303_Controller_Init();
  
  /* Initialize the RTC peripheral */
  RTC_Configuration();
  
  /* Initial graph lib*/
  InitGraph();
  
  /* Initial encoder interface*/
  Enc_Init();
}

/*******************************************************************************
* Function Name  : InitialADC
* Description    : Initial the ADC for voltage measure
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void InitialADC(void)
{
  ADC_InitTypeDef ADC_InitStructure;
  GPIO_InitTypeDef GPIO_InitStructure;
  DMA_InitTypeDef  DMA_InitStructure;
  
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA
                       | RCC_APB2Periph_GPIOB
                       | RCC_APB2Periph_ADC1
                       | RCC_APB2Periph_ADC2,   ENABLE);
  
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
  
  /* Configure PC.0(ADC Channel1, Channel2, )
   as analog input -----------------------------------------------------------*/
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | GPIO_Pin_4;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  
  RCC_ADCCLKConfig(RCC_PCLK2_Div6); /// 12MHz for ADC clock
  
  /* Here we config the ADC1 and ADC2  in regular simultaneous mode
     They are trigerred by TIM3 TRGO signal
    The result will stored in ADC1's DR,
  */
  ADC_DeInit(ADC1);
  ADC_DeInit(ADC2);
  
  ADC_InitStructure.ADC_Mode = ADC_Mode_RegSimult;
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = 
    ADC_ExternalTrigConv_None;
    //ADC_ExternalTrigConv_T3_TRGO;
    //ADC_ExternalTrigConv_T2_CC2;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_NbrOfChannel = 3;
  ADC_Init(ADC1, &ADC_InitStructure);
  ADC_Init(ADC2, &ADC_InitStructure);
  
  ADC_RegularChannelConfig(ADC1, AD_CH_REF, 1, ADC_SampleTime_13Cycles5);
  ADC_RegularChannelConfig(ADC2, AD_CH_BAT, 1, ADC_SampleTime_13Cycles5);
  ADC_RegularChannelConfig(ADC1, AD_CH_X,   2, ADC_SampleTime_13Cycles5);
  ADC_RegularChannelConfig(ADC2, AD_CH_Y,   2, ADC_SampleTime_13Cycles5);
  ADC_RegularChannelConfig(ADC1, AD_CH_Z,   3, ADC_SampleTime_13Cycles5);
  ADC_RegularChannelConfig(ADC2, AD_CH_CHG, 3, ADC_SampleTime_13Cycles5);
  
  /* Initialize the ADC DMA channel */
  ADC_DMACmd(ADC1,ENABLE);
  DMA_DeInit(DMA_ADC);
  DMA_InitStructure.DMA_PeripheralBaseAddr = (u32)(&ADC1->DR);
  DMA_InitStructure.DMA_MemoryBaseAddr = (u32)&ADCResult;
  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
  DMA_InitStructure.DMA_BufferSize = 3;
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Word;
  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Word;
  DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
  DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;//DMA_Priority_Low DMA_Priority_VeryHigh;
  DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  DMA_Init(DMA_ADC, &DMA_InitStructure);
  
  NVIC_InitTypeDef  NVIC_InitStructure;
  NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel1_IRQChannel;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  DMA_ITConfig(DMA_ADC, DMA_IT_TC, ENABLE);
  
  DMA_Cmd(DMA_ADC, ENABLE);
  
  ADC_TempSensorVrefintCmd(ENABLE);
    
  //ADC_ExternalTrigConvCmd(ADC1, ENABLE);
  ADC_ExternalTrigConvCmd(ADC2, ENABLE);
  ADC_Cmd(ADC1, ENABLE);
  ADC_Cmd(ADC2, ENABLE);
  
  ADC_ResetCalibration(ADC1);
  /* Check the end of ADC1 reset calibration register */
  while(ADC_GetResetCalibrationStatus(ADC1));
  /* Start ADC1 calibaration */
  ADC_StartCalibration(ADC1);
  /* Check the end of ADC1 calibration */
  while(ADC_GetCalibrationStatus(ADC1));
  
  
  ADC_ResetCalibration(ADC2);
  /* Check the end of ADC1 reset calibration register */
  while(ADC_GetResetCalibrationStatus(ADC2));
  /* Start ADC1 calibaration */
  ADC_StartCalibration(ADC2);
  /* Check the end of ADC1 calibration */
  while(ADC_GetCalibrationStatus(ADC2));
}

