lxyppc/lxyppc-oled/ lxyppc-oled/STM32/oleddrv/src/main.c
/*******************************************************************************
* Function Name  : DMA1_Channel1_IRQHandler
* Description    : This function handles DMA1 Channel 1 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void DMA1_Channel1_IRQHandler(void)
{
  if(DMA_GetITStatus(DMA1_IT_TC1)){
    DMA_ClearITPendingBit(DMA1_IT_GL1);
    Msg msg;
    if(Is_MMA_WAKEUP()){
      MakeMsgGrav_XY(&msg,ADCResult.ADX,ADCResult.ADY);
      PostMessage(&msg);
      MakeMsgGrav_Z(&msg,ADCResult.ADZ);
      PostMessage(&msg);
    }
  }
}

/*******************************************************************************
* Function Name  : InitialIO
* Description    : Initial the GPIOs
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void InitialIO(void)
{
#ifdef  DEBUG_BOARD
  GPIO_InitTypeDef GPIO_InitStructure;
  RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOD, ENABLE);
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
  
  RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOA, ENABLE);
  RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOB, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
  
  GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
  
  // PA8 is the led 
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  
  // PB4 for PGOOD signal, PB5 for CHG signal
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  
  // PB8 for GSel 2, PB9 for GSel2, PB11 for MMA Sleep
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_11;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  
  GSel1_Low();
  GSel2_Low();
  LED_OFF();
  MMA_WAKEUP();
  
#else
  GPIO_InitTypeDef GPIO_InitStructure;
  RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOA, ENABLE);
  RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOB, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
  
  GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
  
  // PA8 is the led 
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  
  // PB4 for PGOOD signal, PB5 for CHG signal
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  
  // PB8 for GSel 2, PB9 for GSel2, PB11 for MMA Sleep
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_11;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  
  GSel1_Low();
  GSel2_Low();
  LED_OFF();
  MMA_SLEEP();
#endif
}

/*******************************************************************************
* Function Name  : SysTickHandler
* Description    : This function handles SysTick Handler.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
#define   SCROLL_THRESHOLD      4
void SysTickHandler(void)
{
  Msg msg;
  static s16 lastEncCnt = 0;
  encCount = Enc_GetCount();
  if((lastEncCnt ^ encCount) & 0x8000 ){
    lastEncCnt = encCount;
  }
  lastEncCnt += encCount;
  if(lastEncCnt>SCROLL_THRESHOLD){
    msg.param = (void*)((s32)encCount);
    msg.message = MSG_SCROLL;
    PostMessage(&msg);
    lastEncCnt -= SCROLL_THRESHOLD;
  }else if(lastEncCnt<-SCROLL_THRESHOLD){
    msg.param = (void*)((s32)encCount);
    msg.message = MSG_SCROLL;
    PostMessage(&msg);
    lastEncCnt += SCROLL_THRESHOLD;
  }
  static u32 keyDown = 0;
  if(Is_Enc_Key_Down()){
    if(keyDown == 1){
      msg.param = 0;
      msg.message = MSG_KEY_DOWN;
      PostMessage(&msg);
    }
    keyDown++;
  }else{
    if(keyDown > 2){
      msg.param = (void*)keyDown;
      msg.message = MSG_KEY_UP;
      PostMessage(&msg);
    }
    keyDown = 0;
  }
  
//  if(encCount>0){
//    minute++;
//    if(minute>=60)minute = 0;
//  }else if(encCount<0){
//    if(minute){
//      minute--;
//    }else{
//      minute = 59;
//    }
//  }
#ifndef  DEBUG_UI
  StartPageTransfer();
#endif
  
  if(Is_MMA_WAKEUP()){
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);
  }
}

/*******************************************************************************
* Function Name  : NVIC_Configuration
* Description    : Configure the nested vectored interrupt controller.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void  RTC_IRQHandler(void);
void  DMA1_Channel5_IRQHandler(void);
void NVIC_Configuration(void)
{
#if WITH_BOOTLOADER 
  RegisterIrq(-1,SysTickHandler);
  RegisterIrq(RTC_IRQChannel,RTC_IRQHandler);
  RegisterIrq(DMA1_Channel5_IRQChannel,DMA1_Channel5_IRQHandler);
  RegisterIrq(DMA1_Channel1_IRQChannel,DMA1_Channel1_IRQHandler);
#else
#ifdef  VECT_TAB_RAM  
  /* Set the Vector Table base location at 0x20000000 */ 
  NVIC_SetVectorTable(NVIC_VectTab_RAM, 0x0); 
#else  /* VECT_TAB_FLASH  */
  /* Set the Vector Table base location at 0x08000000 */ 
  NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0);   
#endif
  /* 2 bits for pre-emption priority */
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
#endif
}

