lxyppc/lxyppc-oled/ lxyppc-oled/STM32/oleddrv/src/main.c
  BKP_WriteBackupRegister(BKP_DR1, 0xA5A5);
}

/*******************************************************************************
* Function Name  : RTC_IRQHandler
* Description    : This function handles RTC global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void RTC_IRQHandler(void)
{
  if (RTC_GetITStatus(RTC_IT_SEC) != RESET)
  {
    /* Clear the RTC Second interrupt */
    RTC_ClearITPendingBit(RTC_IT_SEC);

    /* Toggle GPIO_LED pin 6 each 1s */
    
    Msg msg;
    msg.param = (void*)RTC_GetCounter();
    msg.message = MSG_SECOND;
    PostMessage(&msg);

    /* Wait until last write operation on RTC registers has finished */
    RTC_WaitForLastTask();
    if(!Is_MMA_WAKEUP()){
      // When MMA is power off, use the seoond interrupt
      ADC_SoftwareStartConvCmd(ADC1, ENABLE);
    }
  }
}

#ifdef  DEBUG
/*******************************************************************************
* Function Name  : assert_failed
* Description    : Reports the name of the source file and the source line number
*                  where the assert_param error has occurred.
* Input          : - file: pointer to the source file name
*                  - line: assert_param error line source number
* Output         : None
* Return         : None
*******************************************************************************/
void assert_failed(u8* file, u32 line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif
/******************* (C) COPYRIGHT 2008 STMicroelectronics *****END OF FILE****/
